{
    "Contact reduction": {
        "definition": "Reduce the number of contacts with process participants (e.g., with customers and third parties), for instance, by batching data to be exchanged.",
        "explanations": "The exchange of information with a client or third party is always time-consuming. Especially when information exchanges take place by regular mail, substantial wait times may be involved. Each contact also introduces the possibility of intruding an error. Hammer and Champy (1993) describes a case where the multitude of bills, invoices, and receipts creates a heavy reconciliation burden.\n\nNote that this heuristic is related to the Interfacing heuristic in the sense that they both try to improve on the collaboration with other parties.\n\nPerformance considerations: Reducing the number of contacts may therefore decrease throughput time and boost quality. Note that it is not always necessary to skip certain information exchanges, but that it is possible to combine them with limited extra cost. A disadvantage of a smaller number of contacts might be the loss of essential information, which is a quality issue. Combining contacts may result in the delivery or receipt of too much data, which involves cost.",
        "examples": "",
        "positive_impact": "Time, Quality",
        "negative_impact": "",
        "references": 205
    },
    "First-contact problem resolution": {
        "definition": "Establish a one-contact resolution for customer issues. Ensure that customers must contact the company only once to get their problems resolved.",
        "explanations": "Companies should ensure that all information needed to solve customer issues are collected at the first encounter in the business process. This reduces the interaction effort on both sides and supports the fast and comprehensive identification of solutions.\n\nImplementation\nThis heuristic can be realized by reducing the number of loops in business processes and by proactively assigning the most suitable employee or IT-based touchpoint (e.g. chatbots).",
        "examples": "At Allianz, call center agents are instructed to serve customers in minimum time by prohibiting repeated calls, by permitting only one forwarding per call and by assigning the most appropriate agent available. This way, customers do not need to describe their problem or needs several times and get support as soon as possible.",
        "positive_impact": "Time",
        "negative_impact": "",
        "references": "Frank, L., Poll, R., Röglinger, M., & Lea, R. (2020). Design heuristics for customer-centric business processes. Business Process Management Journal, 26(6)"
    },
    "Follow-up": {
        "definition": "When waiting for a response/input from a process participant, contact this participant with a reminder and/or propose assistance in completing the activity.",
        "explanations": "This redesign is especially useful to reduce waiting times between internal and external process participants, e.g., employees and customers. Moreover, by providing proactive assistance to customers, it is possible to further enhance their satisfaction.",
        "examples": "In a claim settlement process, a claimant is to submit certain documents as part of the claim. Claimants take an average of seven days to submit the required documents. As the process cannot continue before the documents are submitted, it causes waiting time. To reduce this waiting time, employees can contact the claimants in several days to assist the claimants and use follow-ups to get a quicker response. [116]",
        "positive_impact": "Time, Quality",
        "negative_impact": "",
        "references": 116
    },
    "Customer integration": {
        "definition": "Assign an activity execution to a customer to reduce the employees' workload. ",
        "explanations": "Companies should offer customers the possibility to perform tasks included in business processes that have previously been performed by employees. When implementing this heuristic, companies should consider whether customers can choose between self-service and the traditional process. Companies must also consider that not all tasks included in business processes can be performed by customers.\n\nPerformance considerations: Empowered interaction capability, concerted interaction capability.\n\nBy applying this redesign pattern, the employees' workload could be reduced and employees could focus on the narrower and more specialized scope of tasks. Additionally, when a substantial part of the process can be delegated to customers themselves, it has the potential to free up resource capacity, thereby reducing the need for additional resources, e.g., self-service options in grocery stores. Furthermore, customers can experience reduced waiting times as they no longer have to queue for employee assistance. However, it's crucial to underline that customers should reap tangible benefits from this integration, such as shorter waiting times. If customers do not perceive significant advantages (e.g., customers perform part of the process but waiting times remain high), customer satisfaction may decrease.\n",
        "examples": "Example 1\nIn an outpatient process at a hospital, long waiting times and patient queues occurred due to a lack of personnel to serve all the patients in time. The most extended delay occurred in the payment procedure where the patients needed to wait in a queue for a long time to be served by the cashiers. To overcome delays in the payment procedure, self-payment devices were introduced. Thus, part of the patients are served by the cashiers, and the other part uses self-service devices to make payments. [107]\n\nExample 2 \nIn an incident reporting process at an IT Help Desk, only 30% of the total number of incidents are recorded. Minor issues are not recorded at all. Hence, the same or similar issues are repeatedly solved from scratch which increases the cycle time of the process. A client self-service can be used for resolving minor issues by clients themselves. With access to the Knowledge Base System, clients can review the recorded minor incidents and fix them without contacting customer service. [73]\n\nExample 3 \nA registrar's office at a university deals with several processes, one of which is the matriculation renewal process, which takes place twice a year. During the weeks when the renewal of matriculation occurs, the personnel resources are overloaded, causing the personnel resources to work at high capacity (high resource utilization). Some activities can be assigned to external parties, for instance, a customer: in the matriculation renewal process, students enter their personal data into the system themselves instead of the office workers. [133]\n\nExample 4 \nIn the Virtual Private Network (VPN) connection request handling process, the cost analysis of the process was conducted. It was identified that connection testing appeared to be the most expensive part of the process. Therefore, customers were enabled to conduct the connection testing themselves with the help of a newly introduced test robot. [81]",
        "positive_impact": "Time, Cost, Customer centricity",
        "negative_impact": "",
        "references": "73, 81, 107, 133, 155"
    },
    "Customer scheduling": {
        "definition": "Schedule customer arrivals instead of free arriving to spread the workload throughout the working hours and avoid overcrowding and queues.",
        "explanations": "Customer scheduling offers advantages to both the company and its customers. It effectively evens out employee workloads throughout the day, helping to avoid, e.g., the increased demand during peak hours and long queues. Customers, in their turn, experience reduced waiting times as scheduled appointments eliminate the need to wait in queues for service. ",
        "examples": "Example 1 \nIn a computed tomography (CT) scan process of a hospital, medical imaging is used in the diagnostic phase. Commonly, a bottleneck occurs when the patients arrive to get a tomography scan as they have to wait to be served. Taking into account the demand rate, the throughput of the process is low, i.e., meaning that fewer customers get the service in relation to those waiting. Redesign: Better customer scheduling techniques can eliminate/reduce bottlenecks in the process. In the CT scan process, for instance, the following methods were proposed:\n(1) Schedule patients to build up a buffer of work on standby.\n(2) Schedule patients to minimize variation in cycle times (for example, time slots with homogeneous patient groups).\n(3) Reduce tardiness, no-shows, cancellations, and other disruptions of schedules. [84]\n\nExample 2 \nIn a healthcare recovery ward process, the end of a workday shift (3:45 p.m.) and the end of surgery are the busiest periods during the day. That puts pressure on nurses, making them postpone admissions to the care unit. To address these issues, customer scheduling is introduced. It helps to distribute the workload evenly throughout the day. Thus, all appointments are scheduled according to the employees' pre-defined availability, heavy hours do not intersect, and overloads are avoided. [147]",
        "positive_impact": "Time",
        "negative_impact": "",
        "references": "84, 147"
    },
    "Arrival time incentives": {
        "definition": "Provide incentives to the customers to move them from high- to light-load hours. ",
        "explanations": "",
        "examples": "In a restaurant, customers experience long delays due to excessive workload during peak times as most customers come from 12:00 noon to 1:00 p.m., and the personnel is unable to serve all of them in time. Redesign: Customers can be provided with incentives to move to light-load hours, thereby the customer arrival rate can even up throughout the working hours. For instance, in a restaurant, a special price incentive can be offered to arrivals before noon or after 1:00 p.m. [45]",
        "positive_impact": "Time",
        "negative_impact": "",
        "references": "45, 84"
    },
    "Task elimination": {
        "definition": "Eliminate redundant tasks (i.e., unnecessary activities, non-value-adding practices) from a business process.",
        "explanations": "A common way of regarding an activity as unnecessary is when it adds no value from a client's point of view. Typically, control activities in a workflow do not do this; they are incorporated into the model to fix problems created or not elevated in earlier steps. Control activities can often be found back as iterations and reconciliation tasks.\n\nThis heuristic aims to increase the speed of processing and reduce the cost of handling a case. An important drawback may be that the quality of the service deteriorates.",
        "examples": "Example 1 \nIn a healthcare recovery ward process, the surgery ward makes calls to check if the care unit has a room available for a patient to be transported to the care unit. On average, four calls are required to find a free place. Then, the patient's transportation can be planned. Calling back and forth several times is a non-value-adding activity. Redesign: Non-value-adding activities are eliminated. In the case of the healthcare recovery ward, the care unit is to call the surgery ward once the place is available. [147]\n\nExample 2 \nIn an application submission and review process, the process's last activity is 'Review the Results.' The average number of mistakes found by this review is low: only in 1% of cases mistakes are detected. While there is value in finding mistakes, the effort required outweighs the benefit therefrom. RedesignL Business value-adding activities (BVA) that add little value compared to the estimated cost of their execution (below a certain threshold) can be eliminated. This option should be weighed against the possible consequences of having fewer control steps in place. [137]\n\nExample 3 \nCollection of identical or very similar information. In a faculty, the activity of entering and updating events in a timetable is duplicated due to having two timetable databases. Keeping the data updated in two places requires duplication of activity. Redesign: Duplicate activities are eliminated. In the faculty example, one of the timetable databases was removed and duplicate data entries and updates were eliminated. [52]\n\nExample 4 \nIn a pharmacy procurement process, the purchase order is handed over from the procurement department to the finance department to confirm the supplier. Redesign: The step of confirming the supplier could be removed and the handover will be eliminated. [131]\n\nExample 5 \nIn the manufacturing process, several unnecessary movements of workers are observed. At the planning meeting, the shift supervisor receives production orders and creates a production plan considering the demand for stock. The demand planner then creates process orders in the IT system. When the meeting is over, the shift supervisor goes back to the office and checks if the process orders are correct. Then shift supervisor goes to the production line to assign the orders to the operator. Going from the meeting to the office and then to the production line are the shift supervisor's unnecessary motions. Redesign: Motion activities should be eliminated whenever possible. In the manufacturing process, the shift supervisor can go straight to the production line after the meeting since the order check is considered unnecessary. Therefore, unnecessary checks and motions are eliminated. [119]",
        "positive_impact": "Time, Cost",
        "negative_impact": "",
        "references": "30, 67, 52, 101, 114, 119, 131, 137, 147, 178"
    },
    "Fragment elimination": {
        "definition": "Eliminate redundant fragments (i.e., sets of unnecessary consecutive and/or parallel activities) from a business process.",
        "explanations": "Eliminate fragments that consume time, resources, and/or facilities but add no value to the product from the client's point of view.\n\nA common way of regarding an activity as unnecessary is when it adds no value from a client's point of view. Typically, a set of control activities in a workflow does not add value (from the client's perspective); they are incorporated into the model to fix problems created or not elevated in earlier steps. Control activities can often be found back as iterations and reconciliation tasks.\n\nThis heuristic aims to increase the speed of processing and reduce the cost of handling a case. An important drawback may be that the quality of the service deteriorates.",
        "examples": "",
        "positive_impact": "Time, Cost",
        "negative_impact": "",
        "references": 4
    },
    "Task composition (combination)": {
        "definition": "Combine several small tasks into one composite task.",
        "explanations": "A technique for combining smaller tasks into larger ones to reduce setup times and improve the quality of work.\n\nTask combination is a process optimization technique that involves combining smaller tasks into larger ones. This technique reduces setup times, which are the time that resources need to become familiar with the specifics of a case, and can improve the quality of work. However, it is important to strike a balance between the size of the tasks and their workability. Tasks that are too large can result in smaller run-time flexibility and lower quality. Smaller tasks, on the other hand, can result in longer setup times.\n\nBy finding the optimal balance, organizations can achieve the best of both worlds: shorter setup times, higher quality, and greater flexibility.",
        "examples": "Example 1\nIn a process, several checks are performed in different process parts. Each check requires a set-up time and job handover. While the activity of checking implies similar procedures/steps, the subject of the check (what is checked), the used data, and the resources that execute the checks differ. Redesign: Similar activities can be composed in a single activity. [13]\n\nExample 2 \nSmall activities usually include one or a few fractional procedures such as \"forward data\" or \"notify a customer\". Small tasks can be composed into larger activities. This should result in the reduction of setup times, i.e., the time that is spent by a resource to become familiar with the specifics of a case. By executing a large activity that used to consist of several smaller ones, a positive effect may also be expected on the quality of the delivered work. [206]\n\nExample 3 \nIn a process, there is a waiting time between activity A1 and activity A2. Both activity's processing time is 1 hour but the waiting time between them is 2 days. If activity A1 and activity A2 are combined, the cycle time of the process is reduced to 4 days and 2 hours, which results in a 33% reduction. [64]",
        "positive_impact": "Time, Cost, Quality",
        "negative_impact": "",
        "references": "13, 44, 64"
    },
    "Task decomposition": {
        "definition": "Divide a large task into several smaller tasks.",
        "explanations": "Large activities have many procedures and long processing times compared to other activities in the process. Tasks that are too large can result in smaller run-time flexibility and lower quality. Thus, large activities can be decomposed into several smaller ones. ",
        "examples": "Example 1 \nA process is composed of 14 activities, where the processing time of each activity is given as follows: t1: 10 minutes; t2: 20 minutes; t3: 50 minutes; t4: 12 minutes; t5: 1 minute; t6: 5 minutes; t7: 480 minutes; t8: 5 minutes; t9: 3 minutes; t10: 960 minutes; t11: 1 minute; t12: 8 minutes; t13: 15 minutes; t14: 3 minutes. Tasks t3, t7, and t10 are classified as large. Large activities should be decomposed into smaller ones. Activities t3, t7, and t10 are decomposed. [44]",
        "positive_impact": "Time, Cost, Quality",
        "negative_impact": "",
        "references": 44
    },
    "Process decomposition": {
        "definition": "Divide a complex process into several sub-processes so that each sub-process is short and straightforward, the exchange of materials and information between the sub-processes is minimal, and organizational disruptions within each subprocess are also minimal.",
        "explanations": "",
        "examples": "Example 1 \nRegistrar's office at a university runs the process of matriculation renewal. The process has a complex control flow which may have a negative impact on cycle times and error rates. Redesign: A long and complex process is divided into several sub-processes. To implement the pattern, the activities that can be performed individually and independently a clustered in separate groups to create sub-processes. Thus, the matriculation renewal process is divided into two sub-processes which are ‘Exemption of tuition fees’ and ‘Matriculation renewal’.  The design of these sub-processes is straightforward and hence easier to understand and manage. [133]\n\nExample 2 \nIn an invoicing process, numerous tasks are conducted, including additional tasks (not originally belonging to this process) such as billing working hours and material consumption, and updating inventories. It makes the process very difficult to manage. Since the invoicing procedure has to wait until all included sub-processes have been finished, the cycle time of the process becomes rather long, and the proportion of waiting time is very high. Redesign: A complex process is divided into several sub-processes in such a way that each sub-process is short and straightforward, the exchange of materials and information between the sub-processes is minimal, and organizational disruptions within each subprocess are also minimal. Thus, a complex process is split into smaller logical segments that are easier to understand and manage. Compared to the original process, the cumulated cycle time of the sub-processes is shorter because of fewer waiting times. Error rates decrease due to a clear process specification and a smaller number of dependencies. Since the number of dependencies between the sub-processes is minimal, each sub-process can be managed and changed individually, which enhances flexibility. [133]",
        "positive_impact": "Time, Quality, Flexibility",
        "negative_impact": "",
        "references": 133
    },
    "Process standardization": {
        "definition": "Eliminate process variants.",
        "explanations": "If a process has two or more variants that are similar in how they execute the cases, the process can be standardized (i.e., executed according to one selected variant). Similar process variants can be executed within one or different facilities/departments/locations and/or for different types of products. ",
        "examples": "Example 1 \nWorkers in business services may choose different ways to provide the same service for a client. For example, one may choose to use different search engines, different search procedures, or keywords to find the required information. As a result, even workers with similar or the same job responsibilities may have several variants of the workflows to provide the same set of services. These variants of workflows may be associated with different costs as well. Redesign: All variants are identified and assessed to determine the best practices in these variants, which will be adopted by all the workers. [47]\n\nExample 2 \nA large retail organization operates three brands and has over 300 stores across these brands. Each of the brands executes several administrative processes differently, including the recruitment process. In the first brand, the recruitment process is done by the HR department at the head office. However, the recruitment process for the second brand was conducted by the individual store managers. Redesign: An optimized process variant is developed to be adopted at all three facilities. The process is also documented to maintain compliance with the organization’s policies. [151]",
        "positive_impact": "Time, Cost, Quality",
        "negative_impact": "",
        "references": "47, 88, 151"
    },
    "Process generalization": {
        "definition": "Re-use an existing process capability for additional items, i.e., for producing new products or providing new services, with only minor changes to the process.",
        "explanations": "Explore whether a process can easily be used for additional products or services. Process generalization involves repurposing a procedure to efficiently create fresh value through the cost-effective delivery of novel products or services to the market.\nProcess generalization allows new revenue to be generated from new products or services via the re-use of an existing process capability leading to economies of scope (multiple products/services sharing a process) and a higher return on the process.",
        "examples": "Example 1 \nIn a SIM card ordering process, depending on the SIM card type, the procurement processes are different from each other (different procedures are executed, different documents are required). Redesign: A SIM card ordering process is standardized to become product independent, allowing to include new products in the same process easily. Thus, when a new type of card is available, it can be ordered and serviced using the uniform process instead of designing a new process variant. [88]\n\nExample 2 \nIn the electronics retailer support service, the call center receives calls regarding different types of products. The business machines service center is responsible for managing business products such as copiers and fax machines. The computer service center is responsible for servicing computer products such as personal computers, monitors, and printers. The system products service center is responsible for managing system products such as voicemail. Although all three centers provide customer support, each of them services customers only on specific products according to their specialization. Redesign: The three centers are merged into one consolidated call center to process customer calls independent of the product type. It implied that all call center agents would need to be retrained to handle two other centers' calls. The re-engineered process flow has dramatically streamlined the operations and allowed customers of all product types to access the same hotline. [11]",
        "positive_impact": "Time, Cost, Quality",
        "negative_impact": "",
        "references": "11, 15"
    },
    "Process centralization": {
        "definition": "Having similar processes in several facilities, centralize them into one place to reduce duplication of effort.",
        "explanations": "If a process has two or more variants that are similar in how they execute the cases and are located in several facilities, the process can be unified and centralized in one selected location. These can help us identify a more efficient process variant and minimize duplicated efforts. Consequently, we can free up resources used to execute duplicated tasks.",
        "examples": "A manufacturing company operates a factory, a headquarters, an international division, and six sales subsidiaries. Each subsidiary has separate but similar processes for logistics, financial, and personnel affairs. Redesign: The logistics and organizational processes are centralized and transferred to the headquarters, whereas the company focuses only on sales and inventory management. This reduces the repetition of organizational functions and the excess of workers. [15]",
        "positive_impact": "Time, Cost, Quality",
        "negative_impact": "",
        "references": ""
    },
    "Case-based work": {
        "definition": "Remove batch-processing and periodic activities in favor of processing the cases when they arrive.",
        "explanations": "This pattern recognizes that practical business processes often deviate from the ideal case-based and make-to-order concepts. It acknowledges the presence of constraints like work item batching and periodic activities that rely on specific computer system availability. These constraints can hinder the efficient handling of cases and impede process performance.\n\nBy applying this pattern, organizations can strive to remove these constraints and align their business processes more closely with the case-based approach. This entails eliminating the piling up of work items in batches and finding alternatives to periodic activities that rely on specific system availability. The ultimate goal is to create a more streamlined and efficient process where cases can be handled promptly and without unnecessary delays.\n\nTo understand how this pattern can be enacted in an example process, let's consider a customer support system in an e-commerce company. Currently, the support team receives customer queries in batches and processes them in bulk, leading to delays in response times and potential customer dissatisfaction. The periodic activities, such as generating automated reports or system updates, are performed at fixed times, causing further delays in case resolution.\n\nBy introducing the case-based work pattern, the company can transition to a more efficient and responsive process. They can implement an automated ticketing system that assigns individual cases to support agents as soon as they arrive. This eliminates the need for batch processing and ensures timely attention to each customer inquiry.\n\nAdditionally, the company can leverage technology to remove constraints related to periodic activities. For example, instead of relying on specific system availability for generating reports, they can implement real-time reporting dashboards that are accessible to agents at any time. This enables them to access up-to-date information and resolve cases promptly, without being dependent on specific processing windows.\n\nThrough the adoption of the pattern, the customer support process becomes more streamlined, cases are handled promptly, and customer satisfaction improves. The removal of constraints allows for more agility and responsiveness, resulting in a more efficient and effective support system.\n\n1 Address Constraints: The pattern aims to eliminate constraints such as work item batching and reliance on periodic activities tied to specific computer system availability.\n2 Speed up Case Handling: By removing these constraints, the pattern can significantly improve the efficiency and speed of case handling.\n3 Consider Efficiency vs. Cost: While eliminating constraints may enhance case handling, it is crucial to evaluate the trade-off between the benefits of streamlined processes and the potential costs involved.\n\nSwitching to case-based work can have significant performance implications on the overall process. By eliminating work item batching, cases can be handled more swiftly, reducing delays and improving customer satisfaction. Removing reliance on specific system availability for periodic activities ensures that tasks can be performed consistently, avoiding bottlenecks caused by limited processing windows.\n\nHowever, it's important to consider the trade-off between efficiency and cost. While streamlining the process and removing constraints can enhance case handling, it may require investments in infrastructure, technology, and system availability. Organizations need to assess the potential financial implications and weigh them against the benefits gained in terms of improved efficiency, customer experience, and overall process performance",
        "examples": "Example 1 \nAt a mental healthcare institute, there is an intake process for new requests for non-urgent treatment. Intake of a treatment case starts with a notice by telephone at the secretarial office. Patient information is recorded, handed in at the secretarial office, stored in the information system, and subsequently printed. All new requests are collected within a week (a batch is created). Once a week a staff meeting of the entire medical team (social-medical workers, physicians, and a psychiatrist) takes place to assign all new patients. Thus, the treatment process of a patient does not start until the case is assigned to a certain doctor. Redesign: Case-based work. The team leader has sufficient information on the criteria used for new assignments. Hence, the team leader can carry out new case assignments as soon as they arrive. As a result, the cycle time of the process can be reduced. [77]\n\nExample 2\nThe jobs are accumulated by either waiting for a fixed time interval, or waiting till a fixed time of the day, or waiting till a required number of jobs accumulate. Redesign: Case-based work. Process cases in real-time, i.e. process individual jobs as and when they arrive. [13]",
        "positive_impact": "Time",
        "negative_impact": "",
        "references": "13, 77"
    },
    "Case buffering": {
        "definition": "Create a buffer queue of cases to reduce the time when a case travels from one task to the following one.",
        "explanations": "",
        "examples": "In a health service process, there is a problem of the so-called “three longs and one short” issue. The “three longs” represent the long waiting time for registration, the long waiting time before seeing a doctor, and the long waiting time for buying drugs. Contrary to the “three longs” that can add up to two hours, “one short” indicates that the consult time with physicians is very short, usually around 3 to 5 minutes.        Redesign: Case buffering. In a health service process, an additional queue (called buffer queue) is introduced near the registration counters, eliminating the waiting time when patients are moving to the counter. [23]",
        "positive_impact": "Time",
        "negative_impact": "",
        "references": "23, 84"
    },
    "Periodic action": {
        "definition": "Make an action periodic or change the periodicity of an already recurrent action.",
        "explanations": "If a process involves periodic actions, such as scheduled events or triggering rules for the start of batch processing, these actions can be adjusted. By increasing the frequency of these periodic actions, we can effectively decrease waiting times between activities.",
        "examples": "In a process with several stages, cases were batched before the last stage of the process. That caused a delay before the execution of the last stage and increased the cycle time of the process. Redesign: Periodic action. To reduce the delay time, cases should be executed with a more frequent batching. [48]",
        "positive_impact": "Time, Cost",
        "negative_impact": "",
        "references": "20, 48"
    },
    "Resequencing": {
        "definition": "Reorder the tasks (move tasks to different places).",
        "explanations": "Move activities to more appropriate places. \n\nThe current sequencing of tasks in existing workflows may not fully reflect the logical constraints that need to be observed between tasks. As a result, it can occasionally be advantageous to delay a task, particularly if it is not necessary for tasks that immediately follow. By doing this, there's a chance that the task may turn out to be unnecessary, leading to cost savings. Moreover, positioning a task closer to another task of a similar nature can potentially reduce setup times. Examples of these resequencing strategies include the knock-out heuristic, control relocation, and the parallelism heuristic. ",
        "examples": "Example 1 \nIn a process, several data object handovers between resources are observed. First, Resource 1 processes the case, then Resource 2 processes the case, and then returns the case to Resource 1 for further processing.\tRedesign: Resequencing. Process activities can be resequenced to execute all activities assigned to a particular resource in a row. Thus first, Resource 1 executes all the assigned activities and only then hands over the case to Resource 2. The second handover is then eliminated. [35]\n\nExample 2 \nIn a process, several checks are performed in different process parts. Each check requires a set-up time and job handover. While the activity of checking implies similar procedures/steps, the subject of the check (what is checked), the used data, and the resources that execute the checks differ. Redesign: Resequencing. Similar activities can be moved close to each other reducing setup times for executing these activities [13, 44]. For instance, check activities can be executed one by one. ",
        "positive_impact": "Time, Cost",
        "negative_impact": "",
        "references": "13, 35, 44, 52"
    },
    "Parallelism": {
        "definition": "Place the tasks to be executed in parallel.",
        "explanations": "Consider whether activities may be executed in parallel.\n\nPerformance considerations: The obvious effect of applying this heuristic is that the throughput time may be considerably reduced. The applicability of the heuristic in workflow redesign is large. In practical experiences we have had with analyzing existing workflows, tasks were mostly ordered sequentially without the existence of hard logical restrictions prescribing such an order.\n\nA drawback of introducing more parallelism in a workflow that incorporates possibilities of knock-outs is that the cost of workflow execution may increase. The management of workflows with concurrent behavior can become more complex also, which may introduce errors (quality) or restrict run-time adaptations (flexibility).",
        "examples": "Example 1\nIn a car rental process, ”Prepare Contract” and ”Prepare Car” activities are independent, as a mechanic does the one, and the rental clerk does the other. Activities do not depend on each other for input and output. However, they are ordered sequentially, where first the contract is prepared, and then the car is got ready. Redesign: Parallelism. Sequentially organized activities are put in parallel to be executed concurrently and reduce the process's throughput time. In a car rental process, the rental clerk prepares a contract, and, in parallel, the mechanic prepares a car for a client. [95]\n\nExample 2 \nIn a help desk service process, after the request is received, the operator registers the request in a system. The activity \"Register request\" does not add value to the customer but is required for further internal processing (i.e., is a business value-adding activity). Business value-adding activities can be executed in parallel with value-adding activities. [206]",
        "positive_impact": "Time",
        "negative_impact": "",
        "references": "1995-03-02T00:00:00"
    },
    "Order types (Case types)": {
        "definition": "Determine which tasks are associated with particular types of orders and distinguish separate process paths (fragments or processes) depending on the order type. ",
        "explanations": "\"One should be cautious of parts of business processes that are not specific for the business process they are part of. Ignoring this phenomenon may result in a less effective management of such a sub-process and a lower efficiency. Applying this heuristic may result in faster processing times and less cost.\n\nEspecially Berg and Pottjewijd (1997) convincingly warn for parts of business processes that are not specific for the business process they are part of. Ignoring this phenomenon may result in a less effective management of this \"\"subflow\"\" and a lower efficiency.\n\nNote that this heuristic is in some sense similar to the triage concept. The main interpretation of the triage concept can be seen as a translation of the case type pattern on a activity level.\n\nApplying this best practice may yield faster processing times and less cost. Also, distinguishing common subflows of many different flows may yield effciency gains. Yet, it may also result in more coordination problems between the business process (quality) and less possibilities for rearranging the business process as a whole (flexibility).\"",
        "examples": "In healthcare processes, a common problem is the waiting time for patients throughout the process, i.e., waiting time between the activities executed by the personnel to serve the patients. For instance, long waiting times can be observed between the request for laboratory results and when they are delivered. Redesign: Order types. Reconfigure laboratories so that they can perform the most frequently requested tests faster. [155]\n\n",
        "positive_impact": "Time, Cost",
        "negative_impact": "",
        "references": "62, 84, 146, 148, 155"
    },
    "Triage": {
        "definition": "Divide of a general task into two or more alternative tasks to better align them with the capabilities of resources and the characteristics of the cases being processed.",
        "explanations": "A special form of the triage heuristic is to divide a task into similar instead of alternative tasks for different subcategories of the case type. For example, a special cash desk may be set up for clients with an expected low processing time.\n\nThe triage heuristic is related to the task composition heuristic in the sense that it is concerned with the division and combination of tasks. Note that the heuristic differs from it in the sense that alternative tasks are considered.\n\nWhen applying the pattern in its main form, it is possible to design tasks that are better aligned with the capabilities of resources and the characteristics of the case. Both of these improve the quality of the workflow.\n\nDistinguishing alternative tasks also facilitates a better utilization of resources, with obvious cost and time advantages. On the other hand, too much specialization can make processes become less flexible, less efficient, and cause monotonous work with repercussions for quality. This is lifted by the alternative interpretation of the triage heuristic.",
        "examples": "Example 1 \nIn a pharmacy ordering and dispensing process, the staff number does not match the pharmacy’s care requirements. Each staff member bears more than one responsibility, which makes their workload more exhausting and affects work productivity and quality. Redesign: Two parallel operation windows are introduced: a fast-track window and a normal one. If the prescription has less than three items, then the patient goes to the fast-track window. If the prescription includes more than three items, then they go to the normal window. [148]\n\nExample 2 \nIn a hospital, an emergency treatment process had long waiting times and overcrowding issues. Daily, an average of 150–200 patients were assessed as emergency cases. The number of employees in the emergency department was not enough to help all the arriving patients in time. Therefore, overcrowding occurred during the waiting time before the patients can get the necessary treatment. Redesign:  In an emergency treatment process, the waiting time is reduced by adding a split: a fast track is meant for urgent cases and a regular track is for non-urgent cases where patients can wait. [62]",
        "positive_impact": "Time, Cost, Quality",
        "negative_impact": "",
        "references": "77, 206"
    },
    "Exception": {
        "definition": "Design a business process for typical cases and isolate exceptional cases from the normal flow.",
        "explanations": "The pattern focuses on the recognition that exceptions in a workflow can disrupt normal operations and cause inefficiencies. To address this, the pattern suggests separating exceptions from the regular flow of work to improve overall process performance.\n\nBy isolating exceptions, organizations can assign dedicated workers or teams who specialize in handling these unique cases. This enables the development of specialized expertise and knowledge, leading to more effective and efficient resolution of exceptions. Additionally, by filtering out exceptions, organizations can streamline their processes, potentially implementing Straight-Through-Processing where applicable, reducing manual intervention, and increasing operational efficiency.\n\nHowever, it's important to consider the trade-off between the benefits and the associated costs and complexities. Isolating exceptions can add complexity to the workflow, potentially decreasing its flexibility. It may require additional resources to train and develop specialized knowledge among workers. Without investing in specialized expertise, the desired improvements in handling exceptions may not be realized.\n\nKey Takeaways\n1 Specialized Exception Handling: By assigning specific workers or teams to handle exceptions, expertise can be developed, leading to more effective resolution.\n2 Straight-Through-Processing: Filtering out exceptions may enable the implementation of streamlined, automated processes, reducing manual intervention.\n3 Consider Complexity and Cost: Isolating exceptions adds complexity to the workflow and requires investment in developing specialized knowledge.\nPerformance considerations\nBy separating exceptions, normal case handling becomes more efficient as workers can focus on regular cases without being disrupted by unfamiliar or complex situations. This reduces setup times wasted on dealing with exceptions that workers may not be adequately equipped to handle.\n\nThe specialization of workers or teams in handling exceptions leads to the development of expertise, resulting in more effective and timely resolution of these unique cases. This can lead to improved customer satisfaction, streamlined processes, and reduced operational costs. Additionally, by filtering out exceptions and implementing Straight-Through-Processing, organizations can automate routine tasks, reducing manual effort and increasing process efficiency.\n\nHowever, it's crucial to carefully manage the added complexity that comes with isolating exceptions. The workflow may become more intricate, requiring proper coordination and communication between teams. Furthermore, organizations need to consider the investment required in developing specialized knowledge among workers handling exceptions, as it may involve training, resources, and ongoing support.",
        "examples": "An illustrative example of this pattern can be found in a healthcare setting. In a hospital, the triage process serves as a practical application of isolating exceptions. Patients arriving at the emergency department are initially assessed by triage nurses who quickly identify urgent cases that require immediate attention, such as critical injuries or life-threatening conditions. These cases are isolated and given priority, ensuring they receive specialized care promptly. Meanwhile, the regular flow of patients is handled separately, improving the overall efficiency of patient care delivery in the hospital.",
        "positive_impact": "Time, Quality",
        "negative_impact": "",
        "references": 123
    },
    "Extra resources": {
        "definition": "Increase the number of resources if their capacity is not sufficient.",
        "explanations": "Allocate more people to a task in a process for strategic reasons, such as speeding up the process or reacting to trends. \n\nImplementation\nFor increased resource assignment, details related to expertise, preference, role, workload, productivity, the collaboration of resources, and constraints in process execution need to be known. Based on the needs of the process, additional resources will be matched and allocated to the process.\n\nThe obvious effect of extra resources is that there is more capacity for handling cases, in this way reducing queue time. In particular, adding extra resources can help with reducing waiting time due to resource contention and resource unavailability, It may also help to implement a more flexible assignment policy. Of course, hiring or buying extra resources has its costs.",
        "examples": "Example 1\nWhen launching a new product, increase the number of customer service agents available to handle customer inquiries and support requests to ensure timely and efficient service and enhance the customer experience.\n\nExample 2\nIn a cardiology department, patient transportation is delayed since there is not enough staff to perform the transportation. Patients have to wait until the personnel gets free to serve them. Adding more resources where delays are observed can reduce the waiting times and eliminate bottlenecks. [28]\n\nExample 3\nIn a computed tomography (CT) scan process of a hospital, medical imaging is used in the diagnostic phase. Commonly, a bottleneck occurs when the patients arrive to get a tomography scan as they have to wait to be served. Taking into account the demand rate, the throughput of the process is low, i.e., meaning that fewer customers get the service in relation to those waiting. Additional capacities, for instance, another scan room in the example of the computed tomography scan process, can be introduced leading to adding human resources as well. The introduction of longer working hours can also increase the number of patients served per day with the increase in the involved resources. [84]\n\nExample 4 \nIn an outpatient process at a hospital, long waiting times and patient queues exist due to a lack of personnel to serve all the patients in time. The most extended delay occurred in the payment procedure where the patients needed to wait in a queue for a long time to be served by the cashiers. Redesign: In the hospital outpatient process, a new facility (non-human resources) was built and more specialists (human resources) were allocated to the process. It helped to serve a larger number of patients and reduce waiting times and the cycle time of the whole process. [107]",
        "positive_impact": "Time, Flexibility",
        "negative_impact": "",
        "references": "11, 28, 45, 84, 105, 107, 133, 146, 168"
    },
    "Resource scheduling": {
        "definition": "Schedule more resources during high-load periods and fewer resources during light-load periods.",
        "explanations": "This redesign pattern can be useful to reduce waiting time due to resource contention and resource unavailability. ",
        "examples": "Example 1 \nIn a computed tomography (CT) scan process of a hospital, medical imaging is used in the diagnostic phase. Commonly, a bottleneck occurs when the patients arrive to get a tomography scan as they have to wait to be served. Taking into account the demand rate, the throughput of the process is low, i.e., meaning that fewer customers get the service in relation to those waiting. Redesign: Better resource scheduling techniques can eliminate/reduce bottlenecks in the process. In a CT scan process, it is proposed to adjust resource capacities according to the customer arrival rates. Thus, there are more resources involved in processing the case during the high-demand hours, and fewer resources are in place during the low-demand hours. [84]\n\nExample 2 \nThe support service call center experiences two peak periods (from 10:00 to 11:30 a.m. and 2:00 to 4:00 p.m.) during the day. The employees are unable to process all the calls themselves during these hours. Redesign: Work shifts can be changed so that more employees are in place during the peak periods when low-load periods require fewer employees in a shift. [11]",
        "positive_impact": "Time",
        "negative_impact": "",
        "references": "11, 84"
    },
    "Assign cases": {
        "definition": "Let workers perform as many steps as possible for single cases.",
        "explanations": "A case manager is responsible for a case, he or she does not have to be involved in executing the workflow. By using case assignment in the most extreme form, for each work item, the resource is selected from the ones capable of performing it that has worked on the case before, if any. Rather confusingly, this person is sometimes also referred to as a \"case manager\".\n\nThe obvious advantage of the rule is that this person will get acquainted with the case and will need less set-up time. An additional benefit may be that the quality of service is increased. On the negative side, the flexibility of resource allocation is seriously reduced. A case may experience substantial queue time when its \"case manager\" is not available.",
        "examples": "",
        "positive_impact": "Time, Quality",
        "negative_impact": "",
        "references": "Reijers, H., & Liman Mansar, S. (2005). Best practices in business process redesign: an overview and qualitative evaluation of successful redesign heuristics. Omega, 33(4)"
    },
    "Customer teams": {
        "definition": "Appoint a team of employees (from different departments) to handle a case.",
        "explanations": "Form cross-department teams for end-to-end case handling.\nCompose work teams of people from different departments that will take care of the complete handling of specific sorts of cases.\n\nThis pattern is a variation of the case assignment heuristic. Depending on its exact desired form, the customer team pattern may be implemented by the case assignment pattern. A customer team may involve more workers with the same qualifications also, in this way relaxing the strict requirements of the case assignment rule.\n\nAdvantages and disadvantages are similar to those of the case assignment pattern. In addition, work as a team may improve the attractiveness of the work and a better understanding, which are both quality aspects.",
        "examples": "In a bank, complex and highly customized services require the involvement of multiple specialists across several departments. Thus, complex and highly customized services can be handed over to small case management teams. These teams now have the authority and autonomy to execute these processes from initiation to completion. [178]",
        "positive_impact": "Time, Cost, Quality",
        "negative_impact": "",
        "references": "82, 178"
    },
    "Fixed assignment ": {
        "definition": "Permanently assign resources to an activity associated with the most efficient performance (i.e. the lowest costs, the shortest execution time). ",
        "explanations": "",
        "examples": "In a child delivery process in healthcare, the cost of each activity is calculated. It is found that the cost of the “Epidural Delivery” activity varies depending on which resource executes the activity. For instance, resources P23, P15, and P8 incurred lower costs than the average. Redesign: The resource/-s associated with the lowest cost and highest efficiency of the activity execution should be permanently assigned to perform this activity. [149]",
        "positive_impact": "Time, Cost, Quality",
        "negative_impact": "",
        "references": 149
    },
    "Flexible assignment": {
        "definition": "Assign human resources based not only on availability but also considering other parameters such as resource costs, competencies and skills. ",
        "explanations": "",
        "examples": "A credit company runs a case management process where different types of contracts and credit demands are processed. Only one company employee should handle one contract. Each employee has different skills and experiences concerning the contract type. Currently, contracts are distributed to company employees according to the rule of \"assign a contract to the first non-overloaded employee.\" As a result, the processing time for each contract type varies from one employee to another. For instance, important or complex contracts requiring a high level of expertise can be assigned to temporary workers who do not possess enough skills and experience to deal with such cases. Redesign: Flexible assignment. The main principle is to change the approach of resource allocation based only on availability to an approach that also considers resource competencies and skills. Thus, in the example of credit contract handling, the important and complex contracts are handled by the experts, whereas less experienced or temporal workers process simple contracts. [80]",
        "positive_impact": "Time, Quality",
        "negative_impact": "",
        "references": "80, 152"
    },
    "Case reassignement": {
        "definition": "Provide a possibility to reassign a case execution to a different resource if a current resource experiences difficulties in its execution or is overloaded with other tasks.",
        "explanations": "",
        "examples": "A credit company runs a contract management process. Each contract (case) is handled by only one company employee. Currently, contracts are distributed to company employees according to the common rule \"assign a contract to the first non-overloaded employee\". However, once contracts are assigned to one resource, they cannot be reassigned to another resource. Redesign: Case reassignment.\tThe contract assignment policy should imply the possibility of reassigning a contract to a different employee. Thus, if an employee cannot process the contract, it can be handed over to another employee who has the time and skills to process this case. [80]",
        "positive_impact": "Time, Flexibility",
        "negative_impact": "",
        "references": 80
    },
    "Split responsibilities": {
        "definition": "Assign task responsibilities to resources within a single functional unit instead of resources from different functional units.",
        "explanations": "Avoid shared responsibilities for tasks by people from different functional units.\n\nThe idea behind this redesign pattern is that tasks for which different departments share responsibility are more likely to be a source of neglect and conflict.\n\nReducing the overlap in responsibilities should lead to a better quality of task execution. A higher responsiveness to available work items may be developed also, so that clients are served quicker. On the other hand, reducing the effective number of resources that is available for a work item may have a negative effect on its throughput time, as more queuing may occur.",
        "examples": "In an incident management process at the IT Help Desk, Front Line Team services overlap with the services provided by the Information Technology Services (ITS) division. Redesign: Split responsibilities. Front line team responsibilities are fully assigned to the ITS department to avoid duplication of efforts. Front Line Team staff can be then dismissed. [73]",
        "positive_impact": "Quality",
        "negative_impact": "",
        "references": 73
    },
    "Specialist": {
        "definition": "Make resources more specialized in the execution of particular types of activities or cases.",
        "explanations": "Resources may be turned from specialists into generalists or the other way round. A specialist resource can be trained for other qualifications; a generalist may be assigned to the same type of work for a longer period of time, so that his other qualifications become obsolete. When the redesign of a new process is considered, application of the pattern comes down to considering the specialist-generalist ratio of new hires.\n\nA specialist builds up routine more quickly and may have a more profound knowledge than a generalist. As a result he or she works quicker and delivers higher quality. On the other hand, the availability of generalists adds more flexibility to the process and can lead to a better utilization of resources. Depending on the degree of specialism or generalism, either type of resource may be more costly.\n\nNote that this heuristic differs from the Triage concept in the sense that the focus is not on the division of tasks.",
        "examples": "Example 1\nThe performance of a procurement process in the shipping industry showed that the lead time exceeded the performance standard. One of the causes was the lack of employees who were capable to manage and plan vessel maintenance. Redesign: Specialist. In a procurement process in the shipping industry, a dedicated department called the Planned Maintenance System division, is created and empowered to plan maintenance activity. This division is responsible for creating a detailed vessel maintenance plan. [114]\n\nExample 2 \nIn a credit delivery process, exchanging information between the branch offices and the credit department was known as a critical area of the process. Information on credit request files which are transmitted from the branch offices to the credit department was often missing and incomplete. Retrieving such missing information causes delays and additional communications and therefore increases the total throughput time. Redesign: Specialist. In a credit delivery process, to improve the situation with missing data, a dedicated task force in the credit department was created. This group of employees completes missing information and at the same time assists the branch offices in improving data quality in the future. [188]",
        "positive_impact": "Time",
        "negative_impact": "",
        "references": "91, 114"
    },
    "Empower": {
        "definition": "Give employees the decision-making authority and reduce middle management.",
        "explanations": "Give workers most of the decision-making authority instead of relying on middle management. \n\nIn conventional processes, significant time is used to approve others' work. Granting employees autonomy can lead to streamlined operations and quicker workflows.\n\nExample\nTo streamline the insurance claim process, resources are empowered to make decisions in place of middle management, reducing approval bottlenecks.\n\nImplementation\nTo empower resources, gather information about their capability, productivity, collaboration, and utilisation. Based on this information, identify resources capable of making decisions and provide them with the necessary authority. Communicate the reasons behind the decision to empower resources and the expectations and constraints associated with the decision-making authority.\n\nHowever, this approach might yield lower decision quality and miss obvious errors. When mistakes demand rework, costs may surpass the initial setup.",
        "examples": "Example 1 \nEvery major decision was to be made by or approved by the corporate head office in the supply chain process. This included decisions on pricing, manufacturing schedules, engineering support, and financing. Hence, the waiting time for approval increased the lead time. \tRedesign: Empowe. Redesign implemented for the supply chain process implied changing the organizational structure. Functional orientation was changed to product orientation to become independent from the central office decisions, decrease the approval necessity, and process lead time. Thus, the product departments were empowered to make decisions on the products under their responsibility.\t[43]\n\nExample 2 \nIn a patient intake process in a hospital, non-urgent cases are registered by a secretary and handed over to the nursing office. The nursing officer makes a full inquiry into the patient's mental, health, and social state. This information is recorded on a registration form, handed in at the secretarial office, and stored in the information system. Later, the patient is assigned to a particular physician who defines a treatment plan for the patient. Redesign: Empower. In a patient intake process in a hospital, the nursing officers who intake the patient are allowed to determine the treatment plan themselves. The team leader and psychiatrist only have to check the treatment plan afterward, thus waiting time is reduced, as well as the cycle time of the process. [77]",
        "positive_impact": "Time, Cost",
        "negative_impact": "",
        "references": "43, 72, 77, 91, 123, 183"
    },
    "Department-based assignment": {
        "definition": "Distribute tasks by interdepartmental interactions to enable or restrict involvement.",
        "explanations": "Assign tasks to people based on their interactions with other departments to involve multiple departments or limit involvement.\n\nExample\nThe review loan application task has been assigned to a resource from the finance and human resources departments, as they have shared responsibility.\n\nImplementation\nFor department-based assignments, prior information related to different departments, people in those departments, their skills, and the time involved in handovers may be required. Based on this information and the objective of the process, the appropriate resources would be allocated to the tasks of the process.\n\nThis pattern will result in a high-quality outcome in less time and cost.",
        "examples": "",
        "positive_impact": "Time, Cost, Quality",
        "negative_impact": "",
        "references": "Goel, K., Fehrer, T., Röglinger, M., & Wynn, M. T. (2023). Not Here, But There: Human Resource Allocation Patterns. In Lecture Notes in Computer Science (pp. 377–394)."
    },
    "Experience-based task assignment": {
        "definition": "Delegate task according to experience: execution frequency, case involvement, interactions.",
        "explanations": "Assign a task to a person based on their experience, measured by the number of times they have executed a work item, been involved in a case, and interacted with others. \n\nThis pattern will result in high-quality outcomes in less time.",
        "examples": "Example\nAn organisation assigns a senior manager role in data and analytics to a person with at least 10 project involvements, five project leadership experiences, and team management experience of at least 20 people.\n\nImplementation\nExperience metrics for people must be available. At the time of execution, the experience required for the task will be matched with existing data and to select an appropriate person.",
        "positive_impact": "Time, Quality",
        "negative_impact": "",
        "references": "Goel, K., Fehrer, T., Röglinger, M., & Wynn, M. T. (2023). Not Here, But There: Human Resource Allocation Patterns. In Lecture Notes in Computer Science (pp. 377–394)."
    },
    "Expertise-based task assignment": {
        "definition": "Match tasks to experts' specialized skills for efficiency.",
        "explanations": "Assign tasks based on the unique skills of the person(s) involved. Expertise is defined as the specialised skills possessed by a resource. \n\n",
        "examples": "",
        "positive_impact": "Time, Cost, Quality",
        "negative_impact": "",
        "references": "Goel, K., Fehrer, T., Röglinger, M., & Wynn, M. T. (2023). Not Here, But There: Human Resource Allocation Patterns. In Lecture Notes in Computer Science (pp. 377–394)."
    },
    "Performance-based task assignment": {
        "definition": "Allocate tasks based on past performance: execution time and success.",
        "explanations": "Assign tasks based on a person’s past performance, measured by execution time and successful outcomes. ",
        "examples": "",
        "positive_impact": "Time, Quality",
        "negative_impact": "",
        "references": "Goel, K., Fehrer, T., Röglinger, M., & Wynn, M. T. (2023). Not Here, But There: Human Resource Allocation Patterns. In Lecture Notes in Computer Science (pp. 377–394)."
    },
    "Role-based task assignment": {
        "definition": "Assign tasks based on resources' roles in the organisation.",
        "explanations": "",
        "examples": "",
        "positive_impact": "Time, Flexibility",
        "negative_impact": "",
        "references": "Goel, K., Fehrer, T., Röglinger, M., & Wynn, M. T. (2023). Not Here, But There: Human Resource Allocation Patterns. In Lecture Notes in Computer Science (pp. 377–394)."
    },
    "Teamwork-based assignment": {
        "definition": "Allocate task based on collaborative experience: handover time, interactions, diversity.",
        "explanations": "Assign a task to a person based on their experience working with other resources, which is measured by factors such as the time taken for handovers, number of interactions, and diversity of experience with different people.\n\nImplementation\nFor a teamwork-based assignment, a prior understanding of the interaction of a resource with other resources needs to be known. Based on that understanding, appropriate resources will be allocated.\n\nThis pattern will result in a high-quality outcome in less time and cost.",
        "examples": "Example\nThe review risk task in a loan application process requires two resources to work together. The task is hence allocated to resources A and B as they have evidenced working well together in the past. ",
        "positive_impact": "Time, Cost, Quality",
        "negative_impact": "",
        "references": "Goel, K., Fehrer, T., Röglinger, M., & Wynn, M. T. (2023). Not Here, But There: Human Resource Allocation Patterns. In Lecture Notes in Computer Science (pp. 377–394)."
    },
    "Workload-based task assignment": {
        "definition": "Allocate tasks based on individuals' incomplete workload.",
        "explanations": "Assign tasks to people based on their workload, which refers to the number of task instances started but not yet completed by a person.\n\n",
        "examples": "",
        "positive_impact": "",
        "negative_impact": "",
        "references": "Goel, K., Fehrer, T., Röglinger, M., & Wynn, M. T. (2023). Not Here, But There: Human Resource Allocation Patterns. In Lecture Notes in Computer Science (pp. 377–394)."
    },
    "Task delegation": {
        "definition": "Reassign tasks along the organisational hierarchy.",
        "explanations": "Task delegation is when a person who was originally assigned a task passes it on to another person based on their position in the organisational hierarchy.\n",
        "examples": "",
        "positive_impact": "Time",
        "negative_impact": "",
        "references": "Goel, K., Fehrer, T., Röglinger, M., & Wynn, M. T. (2023). Not Here, But There: Human Resource Allocation Patterns. In Lecture Notes in Computer Science (pp. 377–394)."
    },
    "Inventory buffering": {
        "definition": "Create a buffer stock of materials to reduce the waiting time before the process start.",
        "explanations": "",
        "examples": "Due to the limited production capacities, the raw material suppliers cannot provide the necessary amount of input in time for the production process to start with no delays. As a result, the process cycle time increases, causing production delays. Redesign: Inventory buffering. The supply of raw material input should be rescheduled to create a buffer stock to eliminate/reduce the waiting time for the process to start. The introduction of raw material butter stocks can mitigate the negative impacts of raw material shortage, especially in case of unplanned large volume orders. [16]",
        "positive_impact": "Time",
        "negative_impact": "",
        "references": 16
    },
    "Data elimination": {
        "definition": "Eliminate redundant data from a business process.",
        "explanations": "When eliminating redundant (e.g., duplicated or unnecessary data), the time and costs associated with processing and maintaining these data can be decreased. ",
        "examples": "Example 1 \nIn the retirement process, an employee who is going to be retired should apply for retirement at the governmental body. To apply an applicant should submit eleven documents with personal information. The analysis of these documents revealed that data stated in some documents is repeated in other documents. Hence, the same data is duplicated in different sources. For instance, all the information contained in the 'Certified copy of marriage certificate' is already stated in several other documents available in this process. Redesign:\tData elimination. Duplicate data is eliminated. In the retirement process, out of eleven documents six documents were removed due to data duplication reason. [108]\n\nExample 2\nOn the faculty at the university, two separate timetable databases were used that maintained the same data that were different often in only some details. Each of them required the corresponding data entries and updates. Keeping two identical timetables resulted in data duplication. Redesign: Data elimination. Duplicate data is eliminated. In the faculty example, one of the timetable databases was removed and duplicate data entries and updates were also eliminated. [52]",
        "positive_impact": "Time, Cost",
        "negative_impact": "",
        "references": "52, 108, 178"
    },
    "Data composition": {
        "definition": "Combine several data objects into a composite one.",
        "explanations": "When combining several data objects, the time and costs associated with processing and maintaining these data objects can be decreased. ",
        "examples": "In a manufacturing process, two data objects are used - Order and Record. Order is a data object that contains order details and is created to specify what work should be performed. A Record is a data object that maintains configuration control as required by regulations and standards. Although the practical use of these data objects varies, both data objects represent overlapping information (some fields are the same, however, some fields differ). Redesign: Data composition. Instead of several overlapping data objects, one composite data object is introduced. The composite data object is to contain all the necessary data from Order and Record with no duplication, thus the data duplication redundancy is removed. [69]",
        "positive_impact": "Time, Cost",
        "negative_impact": "",
        "references": 69
    },
    "Data standardization": {
        "definition": "Use standardized data formats and document templates.",
        "explanations": "When using standardized data formats and document templates, processing data objects (e.g. creating such documents or retrieving information from the documents) becomes faster. Thus, the activities related to data processing are streamlined, and the cycle time decreases. ",
        "examples": "In a product development process, information necessary for the process execution was captured in different documents and emails at different locations. These made the needed information not accessible or hard to find for the employees.  Redesign: Data standardization. Standardized templates are established for knowledge documentation to structure the information. Thus, the necessary data can be stored in a structured way, and be easily found and retrieved. [78]",
        "positive_impact": "Time, Cost",
        "negative_impact": "",
        "references": 78
    },
    "Capture data at source": {
        "definition": "Record the data where it is generated and make it available through a shared database.",
        "explanations": "",
        "examples": "Example 1\nIn an incident reporting process at an IT Help Desk, only 30% of the total number of incidents are recorded. Minor issues are not recorded at all. Hence, the same or similar issues are repeatedly solved from scratch which increases the cycle time of the process. Redesign: Capture data at source. All minor and the most frequently occurring issues are recorded. These records are placed in the Knowledge Base System which can be accessed by the support specialists. Thus, 80% of the incidents will be solved at the first level of support. \t[73, 78]\n\nExample 2 \nWhen the same information travels back and forth among different organizational groups - whether it’s rekeyed each time or transmitted electronically. For instance, when people in different parts of the organization have to telephone one another frequently or send a lot of memos or e-mail messages. Redesign: Capture data at source. Capturing data at source and then sharing it instead of shipping the data back and forth. [205]",
        "positive_impact": "Time, Cost, Quality",
        "negative_impact": "",
        "references": "73, 78"
    },
    "Buffer information": {
        "definition": "Buffer external information and subscribe to updates. Instead of requesting information from an external source, buffer it and subscribe to updates.",
        "explanations": "Obtaining information from other parties is a major, time consuming part in many workflows. By having information directly available when it is required, throughput times may be substantially reduced. Note that this buffering is a weak form of the integration pattern. Instead of direct access to the original source of information in the integration alternative a copy is maintained.\n\nThis pattern can be compared to the caching principle microprocessors apply. Of course, the subscription fee for information updates may be rather costly. This is especially so when we consider the situation that an information source may contain far more information than is ever used. Substantial cost may also be involved with storing all the information.",
        "examples": "",
        "positive_impact": "Time",
        "negative_impact": "",
        "references": "Reijers, H., & Liman Mansar, S. (2005). Best practices in business process redesign: an overview and qualitative evaluation of successful redesign heuristics. Omega, 33(4)"
    },
    "Task automation": {
        "definition": "Automate manual tasks.",
        "explanations": "A technique for automating routine and repetitive tasks to improve efficiency and accuracy.\n\nThe \"Activity Automation\" pattern centers around using technology to automate repetitive and routine tasks within a process. By automating these activities, organizations can reduce errors, save time, and allocate resources more effectively. Activity Automation can be accomplished through various tools such as robotic process automation (RPA) or workflow management systems.\n\nThe primary objective of Activity Automation is to eliminate manual effort and reduce the reliance on human intervention for tasks that are repetitive and rule-based. By leveraging automation technology, organizations can improve accuracy, enhance efficiency, and streamline their processes. Employees are freed from mundane and routine activities, allowing them to focus on more strategic and value-added tasks that require human expertise.\n\nImplementing Activity Automation brings significant performance implications to a process. By automating routine tasks, organizations can reduce the risk of human errors, enhancing data accuracy and quality. Time and resource savings are achieved as tasks that were previously manually performed can now be executed efficiently and effectively through automation. This leads to improved overall process efficiency, allowing for faster completion of tasks and reduced cycle times.\n\nFurthermore, Activity Automation enables employees to shift their focus from repetitive tasks to more strategic activities. This not only improves job satisfaction but also enhances the organization's ability to innovate and deliver higher-value outcomes. By leveraging automation technology, organizations can optimize resource allocation, reduce costs, and achieve operational excellence.\n\n1 Automate Routine Tasks: Activity Automation involves using technology to automate repetitive and routine tasks, such as data entry or report generation.\n2 Semi-Automate: Instead of fully automating a task, automatic support also be considered.\n3 Tools for Automation: Activity Automation can be achieved through robotic process automation (RPA) or workflow management systems.\n\nThe positive result of automating tasks can be, in particular, that the tasks can be carried out faster, at a lower cost, and with a better result. An obvious disadvantage is that developing a system to perform a task can be costly. In general, a system that performs a task is also less flexible in dealing with fluctuations than a human resource.",
        "examples": "Example 1 \nManual calculations refer to those activities where calculations are performed by hand or using self-made spreadsheets, possibly causing quality problems and additional effort. Manual calculations can be automated, for instance, with specialized information systems. [30]\n\nExample 2 \nIn a surgical process, hospital personnel had to count each item and surgical tool manually. Before the operation starts, the surgical items are manually counted and verified by two people. This count is then tallied after the surgery is performed. This process is cumbersome, considering that some surgical procedures require between 170 to 300 tools to be counted and verified. Manual counting of the surgical instruments is automated with the tracking IT system based on Radio Frequency Identification (RFID) technology. [50, 54]\n\nExample 3 \nIn a hospital, the process of linen inventory, including distribution, laundry, packing, storing, and collection of linens from different wards requires the staff to manually count linens by estimating the number of linens in the bundles. The estimate does not often reflect the true quantity of linens sent out to the sub-contractor. This process is time-consuming and often results in data errors. Radiofrequency identification (RFID) technology is applied to automate manual tasks of linen counting using RFID stations in the linen department and the wards. Thus, the number of data errors in the process decreases. [54]\n\nExample 4\nRegistrar's office at a university runs the process of matriculation renewal. When matriculation renewal is requested, an employee checks if the payment is received and correct. If so, the matriculation renewal is performed. If not, matriculation renewal is rejected. The decision taken as a result of the payment check is based on predefined rules. Thus, manual routine decisions can be automated based on predefined rules according to which they are made. In a matriculation renewal process, the payment check and decision-making can be automated. [133]\n\nExample 5\nIn a process, the incoming payments listed on bank statements are manually matched against invoices issued to customers. Manual checks are automated. [72]\n\nExample 6\nIn a review process at a university, the study coordinator has to inform the professor in charge that s/he must review the available documents again. For that, the study coordinator needs to find the professor in charge or send an email. Manual notifications can be automated. Thus. in the objection review process in a university, the responsible professor is informed automatically right after the objection document is uploaded into the system. Thus, a reduced cycle time of about 2 minutes is expected. [63]\n\nExample 7 \nIn a patient discharge process, the ward clerk accesses and updates the hospital’s database to actualize a patient’s discharge. Furthermore, the clerk logs into the central database to arrange a follow-up appointment for the patient. Manual data entry activities can be automated. For instance, instead of manual data updates in the hospital database, the updates are performed automatically by the system itself. In a patient discharge process, a patient tracking system based on Radio frequency identification (RFID) automatically updates the patients' status. [139]",
        "positive_impact": "Time, Cost, Quality",
        "negative_impact": "",
        "references": "30, 33, 50, 54, 63, 65, 67, 72, 133, 139, 182"
    },
    "Automate for environmental impact": {
        "definition": "Implement automation in a sustainable way.",
        "explanations": "Business processes are based on both human and IT supported activities that aim at achieving a certain strategic objective. These activities need to be organized in such a way that organizations are most profitable and ecological goals within a given environment can be met. Rationalizing some activities is one possibility to reach this objective.\n\nChallenges\nThe identification of activities that can be automated can be a challenging task. The automated activity needs to perform the task in such a way that either the result remains the same or is even improved or the costs are getting much lower. In the latter case the trade-off between the environmental impact, the costs, and the expected quality needs to be addressed in detail. It must further ensure the global integration with other activities that are dependent on that activity.\n\nSolution\nOrganizations (partially) streamline specific activities within a business process by automating them.\n\nVariations\nSingle activities must not be totally automated. They can also be semi-automated or split into an automated and a manual part to better (i.e. more efficiently) support human process performance.\n\nRelations to other Patterns\nThis pattern is strongly related to Human Process Performance as it covers the contrary situation. Depending on the structure of the business process, both patterns can be used to ecologically optimize processes on an activity changing basis.\n\nThe automatization of specific process activities provides the means for optimizations from both, a regular and an ecological perspective. Time, quality, and costs can be improved while energy consumption can be reduced, for example.",
        "examples": "A telecommunication company needs to send its customers an invoice for their connections every month. Usually, the invoices are sent to the customers via mail. Now, the company has changed the charging process and transmits the information directly and fully automated to the customers via e-mail. This process restructuring saves time, cost, and in particular, decreases the environmental impact caused by paper manufacturing, invoice printing, and the transport of the delivery company.",
        "positive_impact": "Time, Cost, Quality, Sustainability",
        "negative_impact": "",
        "references": "Nowak, A., Leymann, F., Schleicher, D., Schumm, D., & Wagner, S. (2011, October 21). Green business process patterns. Proceedings of the 18th Conference on Pattern Languages of Programs. PLoP 11: Pattern Languages of Programs Conference 2011."
    },
    "Fragment automation": {
        "definition": "Automate manual fragments.",
        "explanations": "Fragments (i.e., sets of consecutive and/or parallel activities) that require full or partial manual execution can be automated. The positive result of automating tasks can be, in particular, that the tasks can be carried out faster, at a lower cost, and with a better result. An obvious disadvantage is that developing a system to perform a task can be costly. In general, a system that performs a task is also less flexible in dealing with fluctuations than a human resource.",
        "examples": "Example 1 \nIn a process, several consecutive system logins are executed by an employee manually. It means that to start working on a case, first, an employee needs to log in to several systems alternately. Manual fragments (sequences of activities) can be automated. Consecutive system logins are combined into one, i.e., once login in one system is successful, logins to all other systems are executed automatically.        [47]\n\nExample 2\nRoutine copy-pasting of certain types of data can be automated, e.g. by automatic data populating. [47]\n\nExample 3 \nFragments that require higher costs/resources for their execution compared to other fragments in the process can be automated. For instance, in the Virtual Private Network (VPN) connection request process, a process's cost analysis was conducted. It was identified that the fragments executing the connection testing appeared to be the most expensive ones in the process. Therefore, a test robot was developed to automate the activities of connection testing. [81]",
        "positive_impact": "Time, Quality",
        "negative_impact": "",
        "references": "47, 81, 142, 182"
    },
    "Process automation": {
        "definition": "Automate manual processes.",
        "explanations": "Processes that are predominantly or largely performed manually can be largely automated. he positive result of automating tasks can be, in particular, that the tasks can be carried out faster, at a lower cost, and with a better result. An obvious disadvantage is that developing a system to perform a task can be costly. In general, a system that performs a task is also less flexible in dealing with fluctuations than a human resource.",
        "examples": "",
        "positive_impact": "Time, Quality",
        "negative_impact": "",
        "references": 178
    },
    "Integral technology ": {
        "definition": "Elevate physical constraints in a business process or facilitate a process execution by applying a technological solution. ",
        "explanations": "In general, new technology can offer all kinds of positive effects. For example, the application of a workflow management system may result in less time that is spent on logistical tasks.\n\nA Document Management System will open up the information available on cases to all participants, which may result in a better quality of service. New technology can also change the traditional way of doing business by giving participants completely new possibilities.\n\nThe purchase, development, implementation, training, and maintenance efforts related to technology are obviously costly. In addition, new technology may arouse fear in workers or may result in other subjective effects; this may deteriorate the quality of the workflow.\n\nIntegral technology can be beneficial for automating manual processes, fragments, and activities; reducing the lack of transparency in the business process; increasing resource reliability; reducing defect rates; replacing costly human resources; eliminating bottlenecks, and queues; and reducing waiting times.",
        "examples": "Example 1 \nContracts handling process was performed manually: contract opening and classification, assignment, check, research associated contract, etc. Thus, an IT system is introduced to facilitate the process, automate activities, and enable automated paperless workflow. [80]\n\nExample 2 \nA traditional trade process is performed manually, where a letter of credit serves as documentary proof of trust among trading participants. Payment is often made when a letter of credit clauses are met. Through the presentation of several logistics-related documents, the ownership of goods or payments can be transferred among trading counterparties. Blockchain technology can be used to facilitate the trade process with the application of smart contracts. A smart contract can enable process automation in a blockchain-based environment by decreasing intermediation, reducing transaction time and cost, and improving process traceability. [144]\n\nExample 3 \nIn a patient treatment process, there is a fragment of laboratory testing. Laboratory testing fragment includes the activities of sample transfer, laboratory analysis, reporting, and diagnosing. The duration of the laboratory testing fragment is about 60 min. This fragment takes the largest part of the processing time.\tIn a patient treatment process, it was proposed to change the test processing method to a faster one. The use of i-stat devices was proposed. With the application of a new method of testing, the activity could be performed faster. \t[62]\n\nExample 4\nIn healthcare processes, a common problem is the waiting time for patients throughout the process, i.e., waiting time between the activities executed by the personnel to treat/serve the patients. For instance, long waiting times can be observed between the request for laboratory results and when they are delivered. To reduce waiting times in the healthcare processes, scheduling and technological solutions (workflow management programs) are used to synchronize the customer arrival rate and reduce waiting times. One approach to reducing the waiting times between the request and receiving of the laboratory results is through the utilization of faster communication technologies such as email to shorten administrative delays. [155]",
        "positive_impact": "Time, Cost, Quality",
        "negative_impact": "",
        "references": "25, 30, 43, 49, 54, 62, 68, 73, 78, 79, 80, 114, 126, 128, 129, 130, 144, 151, 155, 204"
    },
    "Establish standardized interfaces": {
        "definition": "Consider a standardized interface with customers and partners.\n",
        "explanations": "A standardized interface diminishes the occurrence of mistakes, incomplete applications, or unintelligible information exchanges. This may yield better quality due to less errors and faster processing time. \n\nThe concept underlying this heuristic suggests that employing a standardized interface can reduce the likelihood of errors, incomplete submissions, unclear communications, and so forth.\n\nThe interfacing heuristic can be regarded as a particular interpretation of the integration heuristic.",
        "examples": "",
        "positive_impact": "Time, Cost, Quality",
        "negative_impact": "",
        "references": "Reijers, H., & Liman Mansar, S. (2005). Best practices in business process redesign: an overview and qualitative evaluation of successful redesign heuristics. Omega, 33(4)"
    },
    "Batch strategy optimization": {
        "definition": "Adjust batching strategy to reduce waiting time and/or processing time of the batch-processed cases.",
        "explanations": "Batching strategies can be adjusted by: \n1. Changing the batch processing rule (i.e., the rule based on which the batch of cases is started to be processed). \n2. Changing the batch size. By reducing the batch size, the waiting time for collecting the batch (i.e., waiting time due to batching) can be reduced. By increasing the batch size, waiting time due to batching can increase, however, the processing time of the batched cases can be reduced. \n3. Changing the batch processing type. This can help to alter the processing time of the batch. Thus, the more parallelism is in the batch processing, the faster the batch is processed. Therefore, parallel batch processing should be faster than conservative and sequential batch processing. In addition, in parallel batch processing cases do not have to wait for their order to be processed within the batch and, thus, waiting times for each case can be also reduced. However, it might not always be possible to change the batch processing type due to procedure limitations (e.g., an employee cannot examine several loan applications at the same time in parallel) and resource limitations (e.g., the machine can process only one item at a time one by one). \n4. Changing the batch processing frequency. By reducing the batching frequency (i.e., batching cases less often), the waiting time due to batching can be reduced. ",
        "examples": "",
        "positive_impact": "Time",
        "negative_impact": "",
        "references": ""
    },
    "Prioritization strategy optimization": {
        "definition": "Adapt the prioritization strategy to minimize the waiting time for cases that are not receiving priority.",
        "explanations": "Batching strategies can be adjusted by: \n1. Changing the prioritization rule (i.e., the rule based on which the cases are being prioritized). By restricting the prioritization rule (i.e., by making the rule more exclusive, e.g., employing prioritization to a smaller group of clients or based on a less frequent case characteristic), the waiting time due to prioritization of non-priority cases can be reduced. \n2. Changing the prioritization frequency. By reducing the prioritization frequency (i.e., employing prioritization less often), the waiting time due to prioritization can be reduced. ",
        "examples": "",
        "positive_impact": "Time",
        "negative_impact": "",
        "references": ""
    },
    "Resource schedule optimization": {
        "definition": "Adjust the working schedules of the resources to cover the periods when waiting times due to resource unavailability occur. ",
        "explanations": "To reduce waiting time due to resource unavailability, optimize the resource schedules. For that, e.g., more resources should be available during the peak hours of demand and less during low-demand hours. It's important to specify the schedules of which resources can be optimized and what schedules those resources currently have.\nIf necessary, apply also the Extra resources pattern with optimized resource schedules. ",
        "examples": "",
        "positive_impact": "Time",
        "negative_impact": "",
        "references": ""
    }
}